#include <iostream>
#include <vector>

/*
 * В базу данных, являющуюся вектором, с клавиатуры приходят целочисленные значения, и помещаются в конец.
 * Однако, эта база может хранить только 20 элементов, а дальше необходимо будет удалять элементы,
 *  которые лежат в базе дольше всех.
 * При вводе -1 с клавиатуры необходимо вывести всё содержимое базы данных (то есть 20 или менее элементов)
 * Попробуйте написать максимально оптимизированное решение данной задачи,
 *  чтобы совершалось как можно меньше расширений и перемещений элементов внутри вектора.
 */

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
